src/cf/InformationRegisters/вогРолиКонтактныхЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогРолиКонтактныхЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСвязи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.вогОбъектыСвязейКонтаткныхЛиц</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CRM_РольКонтактногоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиКонтактныхЛицПартнеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/вогРолиКонтактныхЛиц/Ext/ManagerModule.bsl
//++ VOG Иванов С.А. 29.10.2019 ID заявки: 000000775
Процедура СоздатьЗаписьРолиКонтактногоЛица(СтруктураЗаписи, Удалить = Ложь) Экспорт
	МенеджерЗаписи = РегистрыСведений.вогРолиКонтактныхЛиц.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.КонтактноеЛицо          = СтруктураЗаписи.КонтактноеЛицо; 
	МенеджерЗаписи.ОбъектСвязи             = СтруктураЗаписи.ОбъектСвязи; 
	МенеджерЗаписи.CRM_РольКонтактногоЛица = СтруктураЗаписи.CRM_РольКонтактногоЛица;
	Если Удалить Тогда
		МенеджерЗаписи.Удалить();
	Иначе
		МенеджерЗаписи.Записать(); 
	КонецЕсли;	
КонецПроцедуры
//-- VOG Иванов С.А. 29.10.2019 ID заявки: 000000775
